// ==== Глобальные скрипты ============================================================================================================================================

fileInclude.include('./functions/smoothScrollTo.js'); // Плавная прокрутка до элемента. Снипет: smoothscroll
fileInclude.include('./functions/scrollDisabling.js'); // Полное отключение прокрутки у элемента. Снипет: scrolldisabling

// ====================================================================================================================================================================