// ==== Глобальные скрипты ============================================================================================================================================

// === Анимации, данный скрипт лучше всего оставить подключённым. Без него не работают некоторые скрипты ==============================================================

fileInclude.include('./functions/_animation.js');

// ====================================================================================== ==============================================================================

// === Мелкие удобные функции, данный скрипт лучшего всего оставить подключённым. Без него не работают некоторые скрипты ==============================================

fileInclude.include('./functions/_functions.js')

// ====================================================================================================================================================================

// === Глобальные функции =============================================================================================================================================

fileInclude.include('./functions/smoothScrollTo.js'); // Плавная прокрутка до элемента. ТРЕБУЕТ _animation.js
fileInclude.include('./functions/scrollDisabling.js'); // Полное отключение/включение прокрутки у элемента.
fileInclude.include('./functions/spoilerCreator.js'); // Спойлеры и аккордионы. ТРЕБУЕТ _animation.js
fileInclude.include('./functions/sendingOnPage.js'); // Проверка и отправка формы без перезагрузки страницы.
fileInclude.include('./functions/phoneMask.js'); // Маска для телефона.
fileInclude.include('./functions/surveySlide.js'); // Опросник в виде слайдов. ТРЕБУЕТ sendingOnPage.js. ТРЕБУЕТ phoneMask.js.
fileInclude.include('./functions/modalWindowCreator.js'); // Модальные окна. ТРЕБУЕТ ScrollDisabling.js
fileInclude.include('./functions/tabsCreator.js'); // Табы.
fileInclude.include('./functions/isMobile.js'); // Проверка на устройство с touch экраном. ТРЕБУЕТ _function.js
fileInclude.include('./functions/sliderCreator.js'); // Слайдер. ТРЕБУЕТ ПОДКЛЮЧЕНИЯ СТОРОННЕЙ БИБЛИОТЕКИ swiper-bundle.min.js В ФАЙЛЕ vendor.js. ТРЕБУЕТ _functions.js

// ====================================================================================================================================================================